emacs_android.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Developing Android APP With Emacs</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Developing Android APP With Emacs"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-30 六"/>
<meta name="author" content="yannik"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./style.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Developing Android APP With Emacs</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Install android SDK and NDK</a></li>
<li><a href="#sec-2">2 Config Emacs</a></li>
<li><a href="#sec-3">3 Start developing android APP</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1"><span class="section-number-3">1</span> Install android SDK and NDK</h3>
<div class="outline-text-3" id="text-1">

<ul>
<li>Download Android SDK and NDK <br/>
   <a href="http://developer.android.com/sdk/index.html">http://developer.android.com/sdk/index.html</a>
</li>
<li>Run <b>android update sdk</b> to start up GUI
</li>
<li>Select and install the package from available packages
</li>
<li>Export path to sdk tools <br/>
  export PATH=${PATH}:/home/yannik/work/android_sdk_ndk/android-sdk-linux/tools
</li>
<li>Create a avd virtual device <br/>
  <b>android creat avd -n AVD -t 1 -b armeabi</b> <br/>
  -n: virtual device name <br/>
  -t: target ID, can get with <b>android list targets</b>
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2"><span class="section-number-3">2</span> Config Emacs</h3>
<div class="outline-text-3" id="text-2">

<ul>
<li>Download <b>android mode</b> <br/>
  <a href="https://github.com/remvee/android-mode">https://github.com/remvee/android-mode</a>
</li>
<li>Config Elisp: <br/>
</li>
</ul>




<pre class="example">(require 'android-mode)
(custom-set-variables
 '(android-mode-avd "AVD")
 '(android-mode-sdk-dir "/opt/android-sdk/"))
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3"><span class="section-number-3">3</span> Start developing android APP</h3>
<div class="outline-text-3" id="text-3">

<ul>
<li>Start emulator <br/>
  <b>M-x android-start-emulator</b>
</li>
<li>Create a project <br/>
  <b>M-x android-create-project</b> <br/>
<ol>
<li>input project path: /home/yannik/work/android_example <br/>
</li>
<li>package name: org.example.helloworld <br/>
</li>
<li>activity name: helloworld <br/>
</li>
</ol>

<p>  or <br/>
  android create project -n helloworld -t 1 -p ./ -k org.example.helloworld -a helloworld
</p></li>
<li>Build and install package <br/>
  C-x C-f PATH-TO-PROJECT and <b>M-x android-build-debug</b> <br/>
  and <b>M-x android-ant-installd</b> to install package
</li>
</ul>



</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-11-30 六</p>
<p class="author">Author: yannik</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
